Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: A work equipment part which needs to be hoisted or raised for cleaning, adjustment or maintenance work shall have an interlocking device or be otherwise securable in the elevated position.
sv: En del av en arbetsutrustning som behöver vara upplyft eller uppfälld vid rengörings-, justerings- eller underhållsarbete skall kunna spärras eller på annat lämpligt sätt säkras i upplyft läge.

source: A 2.25 Fire hazards and emissions
sv: A 2.25 Brandrisk och utsläpp

source: Work equipment shall be designed so as to afford protection against the risk of it catching fire or overheating.
sv: En arbetsutrustning skall vara utförd så att man skyddas mot risken att den fattar eld eller överhettas.

source: In addition it shall be designed to afford protection against emission of gas, dust, liquid, vapour or other substances produced by the work equipment, used in its operation or stored in it.
sv: Dessutom skall den vara utförd för att skydda mot utsläpp av gas, damm, vätska, ånga eller andra ämnen som produceras av arbetsutrustningen, som används vid drift eller som lagras i den.

source: A 2.26 Explosion hazards‌
sv: A 2.26 Explosionsrisk

source: Work equipment shall be designed so as to prevent the risk of explosion.
sv: En arbetsutrustning skall vara utförd så att risken för explosion förebyggs.

source: This applies both to the work equipment itself and to substances produced by it, used in its operation or stored in it.
sv: Det gäller både själva arbetsutrustningen och ämnen som produceras av den, som används vid drift eller som lagras i den.

source: A 2.27 Electrical hazards
sv: A 2.27 Elektriska risker

source: Work equipment shall be designed so that persons wholly or partly present within the risk zone are protected from the risk of direct or indirect contact with electricity.
sv: En arbetsutrustning skall vara konstruerad så att de som helt eller delvis befinner sig inom riskområdet skyddas från risken för direkt eller indirekt kontakt med elektricitet.

source: Further stipulations for specific types of work equipment
sv: Ytterligare krav för särskilda arbetsutrustningar

source: Work equipment with workers riding on it shall be equipped so as to limit the risks to which they are exposed in transit.
sv: En arbetsutrustning med åkande arbetande skall vara utrustad så att riskerna för dem begränsas under förflyttningen.

source: This includes any risks of coming into contact with or getting caught in wheels or belts.
sv: Här ingår eventuella risker för att komma i kontakt med eller fastna i hjul eller band.

source: A 3.1.2 Persons in the immediate vicinity of mobile work equipment
sv: A 3.1.2 Personer i omedelbar närhet av mobila arbetsutrustningar

source: If mobile work equipment is intended to be moved when there are persons in its immediate vicinity, it must be equipped so as to limit the risks to which they are exposed.
sv: Om en mobil arbetsutrustning är avsedd att förflyttas när personer befinner sig i dess omedelbara närhet skall den vara utrustad så att riskerna för dem begränsas.

source: A 3.1.3 Driving cab
sv: A 3.1.3 Förarhytt

source: A cab for protection from cold or heat shall be provided with a device for good air change and a device capable of maintaining a suitable temperature.
sv: En hytt för skydd mot kyla eller värme skall vara försedd med anordning för god luftväxling och anordning som kan hålla lämplig temperatur.

source: The air intakes shall be positioned in such a way that exhaust fumes from the vehicle will not enter the cab.
sv: Luftintagen skall placeras så att avgaser från fordonet inte leds in i hytten.

source: A 3.1.4 Towing device
sv: A 3.1.4 Draganordning

source: A towing device shall be provided with a catch or other device to prevent the object towed from accidentally coming loose.
sv: En draganordning skall vara försedd med spärr eller annan anordning som hindrar att det som dras lossnar oavsiktligt.

source: A 3.1.5 Power restriction
sv: A 3.1.5 Kraftbegränsning

source: Work equipment connected to or towed by a mobile work equipment unit shall be equipped or arranged in such a way that the power transmitted is cut off or restricted in the event of an obstruction or blockage which can entail hazards.
sv: En arbetsutrustning som kopplas till eller bogseras av en mobil arbetsutrustning skall vara utrustad eller anordnad så att den överförda kraften bryts eller begränsas vid fastkörning eller blockering som kan medföra risker.

source: When obstruction or blockage as aforesaid is unavoidable, every conceivable measure shall be taken to prevent anyone being injured.
sv: När det inte går att undvika sådan fastkörning eller blockering skall varje tänkbar åtgärd vidtas för att förhindra att någon kommer till skada.

source: A 3.1.6 Power transmission shaft
sv: A 3.1.6 Kraftöverföringsaxel

source: A power transmission shaft shall be dimensioned for the load, the speeds, the angles and the lengths it is used for.
sv: En kraftöverföringsaxel skall vara dimensionerad för den belastning, de varvtal, de vinklar och de längder den används för.

source: It shall be securable to power takeoffs and inputs.
sv: Den skall kunna låsas säkert på kraftuttag och kraftintag.

source: If a power transmission shaft between different mobile work equipment units can be dirtied or damaged by being dragged over the ground, there must be devices for hanging it up and securing it.
sv: Om en kraftöverföringsaxel, mellan olika enheter av mobila arbetsutrustningar, kan smutsas ned eller skadas av att släpa i marken skall det finnas anordningar så att den kan hängas upp och förankras.

source: A power transmission shaft with universal joints between a self-propelled machine (or tractor) and a driven machine shall be provided with guards for the full length of the shaft, connected universal joints and shaft journals.
sv: En kraftöverföringsaxel med kardanknutar mellan en självgående maskin (eller traktor) och en driven maskin skall vara försedd med skydd över axelns hela längd, anslutna kardanknutar och axeltappar.

source: The guard must not be able to rotate with the power transmission shaft.
sv: Skyddet får inte kunna rotera med kraftöverföringsaxeln.

source: A power transmission shaft and its guard shall be mutually adapted.
sv: En kraftöverföringsaxel och dess skydd skall vara avpassade till var-and-ra.

source: A 3.1.7 Tilting‌
sv: A 3.1.7 Tippning

source: Mobile work equipment with one or more persons riding on it shall be designed so as to limit the risks of injury in the event of it turning over,
sv: En mobil arbetsutrustning med en eller flera åkande skall vara utformad så att riskerna för personskador begränsas om den slår runt

source: either by means of a protective structure preventing it from tilting more than 90 degrees, or
sv: antingen genom en skyddande konstruktion som hindrar den från att tippa mer än ett kvarts varv, eller

source: if it can tilt more than 90 degrees, by means of a structure affording sufficient clearance round the riders, or by means of some other arrangement producing the same result.
sv: om den kan tippa mer än ett kvarts varv, genom en konstruktion som ger tillräckligt med fritt utrymme runt de åkande, eller genom någon annan anordning som ger samma resultat.

source: The protective structure may be an integral part of the work equipment.
sv: Den skyddande konstruktionen får vara en integrerad del av arbetsutrustningen.

source: A structure as aforesaid is not necessary if the work equipment is stabilised when in use or is designed in such a way that it cannot overturn when used normally.
sv: En sådan konstruktion är inte nödvändig om arbetsutrustningen är stabiliserad när den används eller är konstruerad så att den inte kan slå runt vid normal användning.

source: When there is a risk of a rider being crushed between the work equipment and the ground in the event of the work equipment overturning, a device shall exist whereby the riders can fasten themselves in position.
sv: När det finns risk för att en åkande kan komma i kläm mellan arbetsutrustningen och marken, om den skulle slå runt, skall det finnas en anordning så att de åkande kan spänna fast sig.

source: A 3.1.8 Self-propelled work equipment
sv: A 3.1.8 Självgående arbetsutrustningar

source: Self-propelled work equipment which when in motion can entail risks to persons shall meet the following stipulations:
sv: En självgående arbetsutrustning, som kan innebära risker för personer när den är i rörelse, skall uppfylla följande krav:

source: It shall have devices whereby unauthorised starting can be prevented.
sv: Den skall ha anordningar som gör det möjligt att hindra att den obehörigen sätts igång.

source: It shall have devices limiting the consequences of a collision when several trackbound work equipment units are in motion simultaneously.
sv: Den skall ha anordningar som begränsar följderna av en eventuell kollision när flera spårbundna arbetsutrustningar är i rörelse samtidigt.

source: There shall be braking and stopping devices.
sv: Det skall finnas broms- och stoppanordningar.

source: When safety so requires, there shall be emergency stop devices with readily accessible controls or automatic systems for braking and stopping the equipment if the devices normally used should cease to function.
sv: När säkerheten så kräver skall det finnas nödstoppsanordningar med lätt åtkomliga manöverdon eller automatiska system för att bromsa och stoppa utrustningen om de anordningar som normalt används slutar att fungera.

source: When the driver’s direct view is insufficient from a safety viewpoint, there shall be suitable auxiliary equipment for improving the view.
sv: När förarens direkta sikt är otillräcklig från säkerhetssynpunkt, skall det finnas lämplig hjälputrustning så att sikten förbättras.

source: If the equipment is designed for use at night, or in poorly lit places, it shall have lighting which is suitable for the work and affords adequate safety for the workers.
sv: Om den är konstruerad för att användas på natten, eller där belysningen är dålig, skall den ha belysning som är lämplig för arbetet och ger tillräcklig säkerhet för de arbetande.

source: If the equipment can entail a risk of fire, due to the possibility of the equipment itself or whatever is being towed or carried by it catching fire, it shall be provided with suitable extinguishing equipment if no such equipment is provided near the place where the equipment is used.
sv: Om utrustningen kan medföra brandrisk, på grund av att själva utrustningen eller det som bogseras eller bärs av den kan fatta eld, skall den vara försedd med lämplig släckutrustning om det inte finns någon sådan i närheten av den plats där utrustningen används.

source: If it is remote controlled, it shall stop automatically if out of range of the remote control.
sv: Om den är fjärrstyrd skall den stanna automatiskt om den kommer utanför fjärrstyrningens räckvidd.

source: Remote-controlled equipment which under normal conditions can entail a risk of collision or persons being crushed shall be provided with devices affording protection from this risk, unless there are suitable devices on the site which avert the risk of collision.
sv: En fjärrstyrd utrustning, som under normala förhållanden kan medföra risk för påkörning eller klämning, skall vara försedd med anordningar som skyddar mot denna risk, om det inte finns lämpliga anordningar på platsen som förebygger risken för påkörning.

source: Equipment which has been stopped shall be secured against inadvertent movement.
sv: En utrustning som stoppats skall vara säkrad mot oavsiktlig rörelse.

source: Intentional actuation by the driver shall be the only possible way of setting it in motion.
sv: Den skall endast kunna sättas i rörelse genom avsiktlig påverkan av föraren.

source: Equipment with a rider driver shall have a signalling device enabling the driver to attract attention without difficulty.
sv: En utrustning med åkande förare skall ha signalanordning så att föraren lätt kan påkalla uppmärksamhet.

source: A 3.2 Pallet racks and other warehousing racks
sv: A 3.2 Pallställ och andra lagerställ

source: A warehousing rack intended for varying loads shall be conspicuously and permanently marked with the maximum load per section and maximum load per tier.
sv: Ett lagerställ som är avsett för varierande laster skall, på väl synlig plats, vara beständigt märkt med maxlast per sektion och maxlast per bärplan.

source: If collision can entail risks, a collision protector shall be provided.
sv: Om påkörning kan medföra risker skall det finnas påkörningsskydd.

source: A pallet rack shall be anchored if there is a risk of instability.
sv: Ett pallställ skall vara förankrat om det finns risk för instabilitet.

source: A pallet rack shall be provided with guards which prevent pallets being pushed through the rack (pallet stops), except where manifestly unnecessary.
sv: Ett pallställ skall vara försett med skydd som förhindrar att pallar skjuts genom stället (s.k. genomskjutningsskydd), om det inte är uppenbart onödigt.

source: A 3.3 Conveyors
sv: A 3.3 Transportörer

source: A conveyor shall have such a gradient or be otherwise so designed that the load will not accidentally slide.
sv: En transportör skall ha sådan lutning eller på annat sätt vara utförd så att lasten inte glider oavsiktligt.

source: A conveyor shall have a brake which stops it if the speed can increase or the direction of travel change under the influence of the load when the driving power ceases.
sv: En transportör skall ha broms som stoppar den om hastigheten kan öka eller transportriktningen ändras genom påverkan från lasten när drivkraften upphör.

source: A brake can be replaced with a back stop if it is only the direction of movement which is liable to change.
sv: En broms kan ersättas med backspärr om det bara är transportriktningen som kan ändras.

source: Annex B‌
sv: Bilaga B‌‌

source: Organisational stipulations
sv: Organisatoriska krav

source: B 2.1 Assembly, installation, dismantling, service, maintenance, cleaning and inspection
sv: B 2.1 Montering, installation, demontering, service, underhåll, rengöring och besiktning

source: Assembly, installation, dismantling, service, maintenance, cleaning and inspection are to be performed in a safe manner.
sv: Monterings-, installations-, demonterings-, service-, underhålls- och rengöringsarbeten samt besiktning skall utföras på ett säkert sätt.

source: Special consideration shall be paid to manufacturer’s instructions.
sv: Särskild hänsyn skall tas till anvisningar från tillverkaren.

source: The work shall be planned and prepared and, if necessary
sv: Arbetet skall planeras och förberedas och om det behövs skall

source: written instructions for the work shall be drawn up, a person shall be appointed to take charge of coordinating the work and to take general responsibility for safety.
sv: en skriftlig instruktion för arbetet upprättas, någon utses som ansvarar för att samordna arbetet och som har ett övergripande ansvar för säkerheten.

source: Normally, when servicing, maintenance and cleaning is in progress, the energy supply shall be disconnected and, except where manifestly unnecessary, the disconnection device shall be locked.
sv: Vid service-, underhålls- och rengöringsarbeten skall ingående energitillförsel normalt frånkopplas och om det inte är uppenbart onödigt skall frånkopplingsdonet låsas.

source: Measures shall be taken to ensure that any energy accumulated in the work equipment cannot cause unforeseen movements or other dangerous occurrences.
sv: Åtgärder skall vidtas så att eventuell ackumulerad energi inne i arbetsutrustningen inte kan orsaka oförutsedda rörelser eller andra farliga händelser.

source: Signs indicating that servicing, maintenance, cleaning or inspection is in progress shall be put up except where manifestly unnecessary.
sv: Om det inte är uppenbart omotiverat skall det finnas skyltar med upplysning om att service-, underhålls-, rengörings- eller besiktningsarbete pågår.

source: B 2.2 Setting of safety devices etc.
sv: B 2.2 Inställning av skyddsanordningar m.m.

source: Adjustable safety devices and other devices with a safety function, shall, where the safety function depends on the setting, be correctly set and properly secured.
sv: Ställbara skyddsanordningar och andra anordningar med skyddsfunktion, där skyddsfunktionen är beroende av inställningen, skall vara rätt inställda och ordentligt fastsatta.

source: B 2.3 Malfunction
sv: B 2.3 Driftstörningar

source: Work equipment shall be safely stopped or otherwise secured when malfunctions are being rectified or other temporary work is in progress within the danger zone surrounding the equipment.
sv: En arbetsutrustning skall vara säkert stoppad eller på annat sätt säkrad när driftstörningar avhjälps eller vid annat tillfälligt arbete i utrustningens riskområde.

source: B 2.4 De-activated safety devices
sv: B 2.4 Avaktiverade skyddsanordningar

source: For work requiring a safety device to be temporarily rendered inoperative or temporarily removed, measures shall be taken to ensure that the work can still be done safely.
sv: Vid ett arbete som kräver att en skyddsanordning tillfälligt sätts ur funktion eller tas bort skall åtgärder vidtas så att det ändå går att utföra arbetet säkert.

source: The device shall be reinstated as soon as the work is completed.
sv: Anordningen skall genast återställas när arbetet är avslutat.

source: B 2.5 Lightning strike
sv: B 2.5 Blixtnedslag

source: Work equipment vulnerable to lightning strikes shall when in use be provided with a suitable device affording protection from the effects of a lightning strike, so that nobody will be injured.
sv: En arbetsutrustning som kan drabbas av blixtnedslag när den används skall vara försedd med lämplig anordning som skyddar mot effekterna av ett sådant, så att inte någon kommer till skada.

source: Self-propelled work equipment may only be driven by a person sufficiently skilled to drive it safely.
sv: En självgående arbetsutrustning får endast framföras av en person som har tillräckliga kunskaper för att framföra den säkert.

source: B 3.2 Traffic regulations
sv: B 3.2 Trafikregler

source: Traffic regulations shall be adopted and complied with whenever mobile work equipment is in motion within a worksite.
sv: Då mobila arbetsutrustningar rör sig inom ett arbetsområde skall trafikregler fastställas och följas.

source: B 3.3 Pedestrian workers
sv: B 3.3 Arbetande till fots‌

source: Measures shall be taken to prevent pedestrian workers entering a zone where self-propelled work equipment is in operation.
sv: Åtgärder skall vidtas så att arbetande till fots inte kan komma in på ett område där självgående arbetsutrustningar är igång.

source: If the presence of pedestrian workers is necessary in order for work to be properly completed, suitable measures shall be taken to prevent them being injured by the equipment.
sv: Om det krävs att arbetande till fots är närvarande för att ett arbete skall bli fullgott skall lämpliga åtgärder vidtas för att förhindra att de skadas av utrustningen.

source: B 3.4 Passenger transport
sv: B 3.4 Persontransporter

source: Personnel may be carried on mobile, power driven work equipment only if suitable safety measures have been taken.
sv: Personer får bara transporteras på mobila maskindrivna arbetsutrustningar om lämpliga skyddsåtgärder vidtagits.

source: If work has to be done in transit, the speed shall if necessary be adapted accordingly.
sv: Om arbete måste utföras under färden skall hastigheten vid behov anpassas till detta.

source: B 3.5 Air change
sv: B 3.5 Luftväxling

source: Mobile work equipment with a combustion engine may not be used on worksites if the air change is insufficient to guarantee health and safety.
sv: En mobil arbetsutrustning med förbränningsmotor får inte användas på arbetsområden om luftväxlingen inte är tillräcklig för att garantera hälsa och säkerhet.

source: B 3.6 External factors
sv: B 3.6 Yttre faktorer

source: Work with mobile work equipment shall be planned according to the special risks which terrain, weather and the work itself may entail.
sv: Ett arbete med mobila arbetsutrustningar skall planeras med hänsyn till de särskilda risker som terräng, väderlek och aktuellt arbete kan medföra.

source: B 3.7 Prevention of inadvertent movement
sv: B 3.7 Säkring mot oavsiktlig rörelse

source: Machine parts shall be secured if there is a risk of dangerous inadvertent movements in transit or when the driver has left the driving or operating position.
sv: Maskindelar skall vara säkrade om det finns risk för farliga oavsiktliga rörelser vid färd eller när föraren lämnat förar- eller operatörsplatsen.

source: Work equipment which has been stopped shall be secured against inadvertent movement so that it can only be set in motion intentionally.
sv: En arbetsutrustning som stoppats skall vara säkrad mot oavsiktlig rörelse så att den endast kan sättas i rörelse avsiktligt.

source: Further stipulations regarding use of work equipment intended for temporary work at levels above ground or floor level or other work at height‌
sv: Ytterligare krav vid användning av arbetsutrustningar avsedda för tillfälligt arbete på nivåer över mark- eller golvplan eller annat höjdarbete

source: B 4.1 General
sv: B 4.1 Allmänt

source: B 4.1.1 Choice of work equipment
sv: B 4.1.1 Val av arbetsutrustning

source: If temporary work at levels above ground or floor level or other work at height cannot be done safely from a suitable surface and in ergonomically appropriate conditions, the work equipment shall be chosen by which safe working conditions are best guaranteed and sustained.
sv: Om ett tillfälligt arbete på nivåer över mark- eller golvplan, eller annat höjdarbete, inte kan utföras säkert från ett lämpligt underlag och under ergonomiskt lämpliga förhållanden, skall den arbetsutrustning väljas som bäst garanterar och upprätthåller säkra arbetsförhållanden.

source: Collective protection measures shall have priority over the use of personal protective equipment.
sv: Gemensamma skyddsåtgärder skall prioriteras före användning av personlig skyddsutrustning.

source: The work equipment shall be dimensioned and designed for the work to be done and for the loads which can be foreseen.
sv: Arbetsutrustningen skall vara dimensionerad och utformad för det arbete som skall utföras och för de belastningar som går att förutse.

source: The work equipment shall also allow passage without danger.
sv: Arbetsutrustningen skall också göra det möjligt att förflytta sig riskfritt.

source: The most suitable manner of access to a temporary worksite involving work at height shall be chosen according to the frequency of passage, the height and the intended duration of the work.
sv: Lämpligaste sättet för tillträde till en tillfällig arbetsplats vid höjdarbete skall väljas med hänsyn till antalet förflyttningar, höjden och hur länge arbetet skall pågå.

source: In addition, evacuation must be possible in the event of imminent danger.
sv: Det skall också gå att utrymma arbetsplatsen i en nödsituation.

source: Motion between access equipment and platforms, decks or gangways must not entail any further risk of falls.
sv: Förflyttning mellan utrustning för tillträde och plattform, ställningslag eller landgång får inte innebära någon ytterligare fallrisk.

source: B 4.1.2 Rope access
sv: B 4.1.2 Reparbete
